EgorNezox/Lol/system/platform/stm32f2-common/system_hardware/uart.c
/**
  ******************************************************************************
  * @file    uart.c
  * @author  Artem Pisarenko, PMR dept. software team, ONIIP, PJSC
  * @date    28.08.2015
  * @brief   Реализация аппаратной абстракции доступа к UART на STM32F2xx
  *
  * UART работает в полнодуплексном режиме.
  *
  * Внимание! Доступ к внутренним буферам может осуществляться только из критической секции
  * или из контекста обработчика прерывания с приоритетом не выше SYS_IRQ_CHANNEL_PREEMPTION_PRIORITY.
  * (См. порядок работы и синхронизацию доступа в документации hal_ringbuffer.)
  * Callback'и c префиксом isr означают, что они выполняются из контекста обработчика прерывания. Все вызываемые из них функции FreeRTOS должны использовать аргумент pxHigherPriorityTaskWoken.
  * Все callback'и должны выполняться очень быстро и не содержать блокирующих вызовов
  * (правильная реализация должна выполнять в них только установку флагов и неблокирующие вызовы функций синхронизации FreeRTOS).
  *
  * Прием(Rx):
  * Работает через DMA с использованием внутреннего коммуникационного кольцевого буфера приема.
  * Фактический размер буфера расширяется (наиболее оптимальным способом) с учетом макс. задержки обработки прерываний заданного приоритета в системе,
  * значения мин. интервала задержки непрочитанных данных, конфигурации аппаратного управления потоком и скорости UART.
  * Ресурсы DMA статически выделены для каждого экземпляра UART и недоступны для использования в других модулях.
  * DMA-поток функционирует в режиме Circular direct mode (peripheral-to-memory) и пишет напрямую в память кольцевого буфера.
  * При запуске приема включается DMA-передача, при обнаружении переполнения буфера DMA-передача выключается.
  * При запуске кольцевой буфер сбрасывается на начало, т.к. DMA не поддерживает запись с произвольного места в кольцевом буфере.
  * Флаги DMA "Half-transfer reached" и "Transfer complete" используются для отслеживания продвижения указателя записи по отношению к текущему указателю чтения
  * (поочередно снимаются, а если оба обнаружены выставленными, то считается что произошло критическое переполнение буфера, но такое переполнение исключено в нормальных условиях
  *  благодаря дополнительному расширению буфера).
  * По прерываниям RXNE от UART (а также по таймауту задержки индикации непрочитанных данных, если таковой интервал используется) обновляется указатель записи (см. выше)
  * и отслеживается обычное переполнение буфера. Буфер считается переполненным, если свободное место меньше дополнительного(расширенного) пространства.
  * Приложение может считывать данные из буфера путем вызова функции hal_uart_receive()
  * или напрямую читать из приемного буфера, возвращаенного при открытии UART, выполняя роль потребителя данных.
  * Оптимизировать обработку приема можно путем задания ненулевого интервала задержки индикации непрочитанных данных в буфере.
  * Размер буфера приема должен задаваться с учетом этой задержки и скорости uart.
  * isrcallbackRxDataPending: аргумент unread_bytes_count указывает размер непрочитанных на момент вызова данных в буфере.
  * isrcallbackRxDataErrors: аргумент error_bytes_count указывает размер данных, содержащихся в начале непрочитанных на момент вызова данных в буфере,
  *  корректность которых не гарантируется.
  * isrcallbackRxOverflowSuspended: на момент вызова в буфере отсутствует свободное место,
  *  новые данные не принимаются и ошибки не обнаруживаются до тех пор пока прием не будет возобновлен вызовом hal_uart_start_rx.
  *
  * Передача(Tx):
  * Работает через прерывания USART (посимвольно) с использованием буфера данных.
  * Приложению доступны три способа:
  * - асинхронно из внутреннего кольцевого буфера передачи, выполняя роль производителя данных
  *   (запускается/возобновляется вызовами hal_uart_start_tx(), приостанавливается при завершении отправки последнего байта из буфера)
  *   (с использованием callback-функций isrcallbackTxSpacePending, isrcallbackTxCompleted)
  * - асинхронно из выделяемого приложением буфера данных
  *   (с использованием callback-функции isrcallbackTxCompleted)
  * - блокирующий, из выделяемого приложением буфера данных.
  * isrcallbackTxSpacePending: вызывается только при использовании передачи из внутреннего буфера,
  *                            аргумент available_bytes_count указывает размер свободного места в буфере на момент вызова
  * isrcallbackTxCompleted: вызывается только при ииспользовании асинхронной передачи и обозначает ее завершение (не обязательно успешное)
  *
  * Заняты следующие аппаратные ресурсы:
  * - все UART и USART
  * - DMA1 Stream 0
  * - DMA1 Stream 1
  * - DMA1 Stream 2
  * - DMA1 Stream 5
  * - DMA2 Stream 1
  * - DMA2 Stream 2
  *
  ******************************************************************************
  */

#include <stdbool.h>
#include <string.h>
#include <math.h>
#include "stm32f2xx.h"
#include "FreeRTOS.h"
#include "semphr.h"
#include "timers.h"

#include "sys_internal.h"
#include "sys_internal_freertos_timers.h"
#include "hal_uart.h"

#if configUSE_TIMERS == 0
#error "FreeRTOS must be configured to use software timers"
#endif

#define UART_INSTANCES_COUNT 6

#define DEFINE_PCB_FROM_HANDLE(var_pcb, handle) \
	struct s_uart_pcb *var_pcb = (struct s_uart_pcb *)handle; \
	SYS_ASSERT(var_pcb != 0);

static struct s_uart_pcb {
	USART_TypeDef* usart;
	IRQn_Type usart_irq_n;
	uint8_t usart_apb;
	uint32_t usart_rcc_apb_mask;
	DMA_TypeDef* dma_rx;
	uint8_t dma_rx_stream_number;
	DMA_Stream_TypeDef* dma_rx_stream;
	IRQn_Type dma_rx_stream_irq_n;
	uint32_t dma_rx_rcc_ahb1enr;
	uint8_t dma_rx_channel;
	uint32_t dma_rx_teif_mask;
	uint32_t dma_rx_tcif_mask;
	uint32_t dma_rx_htif_mask;
	bool is_open;
	void *userid;
	hal_ringbuffer_t *rx_buffer;
	size_t rx_buffer_extra_space;
	bool rx_data_defer_indication; // use deferred rx unread data indication
	TimerHandle_t rx_data_timer; // (optional) timer used to defer rx unread data indication (data "flush")
	enum {
		rxdatatimerIdle,
		rxdatatimerActive,
		rxdatatimerExpired
	} rx_data_timer_state; // (optional) rx_data_timer state used for deferred indication of rx unread data
	void (*isrcallbackRxDataPending)(hal_uart_handle_t handle, size_t unread_bytes_count, signed portBASE_TYPE *pxHigherPriorityTaskWoken);
	void (*isrcallbackRxDataErrors)(hal_uart_handle_t handle, size_t error_bytes_count, signed portBASE_TYPE *pxHigherPriorityTaskWoken);
	void (*isrcallbackRxOverflowSuspended)(hal_uart_handle_t handle, signed portBASE_TYPE *pxHigherPriorityTaskWoken);
	void (*isrcallbackTxSpacePending)(hal_uart_handle_t handle, size_t available_bytes_count, signed portBASE_TYPE *pxHigherPriorityTaskWoken);
	void (*isrcallbackTxCompleted)(hal_uart_handle_t handle, signed portBASE_TYPE *pxHigherPriorityTaskWoken);
	hal_ringbuffer_t *tx_buffer;
	enum {
		txtransferNone, // no transmission active
		txtransferActiveInternal, // asynchronous transmission from internal tx_buffer is active (uses isrcallbackTxSpacePending, isrcallbackTxCompleted)
		txtransferActiveExternalAsync, // asynchronous transmission of external data is active (uses isrcallbackTxCompleted)
		txtransferActiveExternalSync, // synchronous transmission of external data is active (uses smphr_tx_complete)
	} tx_transfer;
	uint8_t *tx_transfer_data_ptr; // incrementing pointer to external data buffer (active transmission)
	size_t tx_transfer_pending_size; // remaining size of data from external buffer (active transmission)
	SemaphoreHandle_t smphr_tx_complete; // used for transmission completion synchronization
} uart_pcbs[UART_INSTANCES_COUNT] = {
		{USART1, USART1_IRQn, 2, RCC_APB2ENR_USART1EN, DMA2, 2, DMA2_Stream2, DMA2_Stream2_IRQn, RCC_AHB1ENR_DMA2EN, 4, DMA_LISR_TEIF2, DMA_LISR_TCIF2, DMA_LISR_HTIF2, false, 0, 0, 0, false, 0, rxdatatimerIdle, NULL, NULL, NULL, NULL, NULL, 0, txtransferNone, 0, 0, 0},
		{USART2, USART2_IRQn, 1, RCC_APB1ENR_USART2EN, DMA1, 5, DMA1_Stream5, DMA1_Stream5_IRQn, RCC_AHB1ENR_DMA1EN, 4, DMA_HISR_TEIF5, DMA_HISR_TCIF5, DMA_HISR_HTIF5, false, 0, 0, 0, false, 0, rxdatatimerIdle, NULL, NULL, NULL, NULL, NULL, 0, txtransferNone, 0, 0, 0},
		{USART3, USART3_IRQn, 1, RCC_APB1ENR_USART3EN, DMA1, 1, DMA1_Stream1, DMA1_Stream1_IRQn, RCC_AHB1ENR_DMA1EN, 4, DMA_LISR_TEIF1, DMA_LISR_TCIF1, DMA_LISR_HTIF1, false, 0, 0, 0, false, 0, rxdatatimerIdle, NULL, NULL, NULL, NULL, NULL, 0, txtransferNone, 0, 0, 0},
		{UART4, UART4_IRQn, 1, RCC_APB1ENR_UART4EN, DMA1, 2, DMA1_Stream2, DMA1_Stream2_IRQn, RCC_AHB1ENR_DMA1EN, 4, DMA_LISR_TEIF2, DMA_LISR_TCIF2, DMA_LISR_HTIF2, false, 0, 0, 0, false, 0, rxdatatimerIdle, NULL, NULL, NULL, NULL, NULL, 0, txtransferNone, 0, 0, 0},
		{UART5, UART5_IRQn, 1, RCC_APB1ENR_UART5EN, DMA1, 0, DMA1_Stream0, DMA1_Stream0_IRQn, RCC_AHB1ENR_DMA1EN, 4, DMA_LISR_TEIF0, DMA_LISR_TCIF0, DMA_LISR_HTIF0, false, 0, 0, 0, false, 0, rxdatatimerIdle, NULL, NULL, NULL, NULL, NULL, 0, txtransferNone, 0, 0, 0},
		{USART6, USART6_IRQn, 2, RCC_APB2ENR_USART6EN, DMA2, 1, DMA2_Stream1, DMA2_Stream1_IRQn, RCC_AHB1ENR_DMA2EN, 5, DMA_LISR_TEIF1, DMA_LISR_TCIF1, DMA_LISR_HTIF1, false, 0, 0, 0, false, 0, rxdatatimerIdle, NULL, NULL, NULL, NULL, NULL, 0, txtransferNone, 0, 0, 0},
};

static double uart_character_rate_from_baud_rate(uint32_t rate, hal_uart_stop_bits_t stop_bits, hal_uart_parity_t parity);
static void uart_set_rx_interrupts(struct s_uart_pcb *uart, FunctionalState state);
static void uart_set_tx_interrupts(struct s_uart_pcb *uart, FunctionalState state);
static bool uart_get_dma_te_flag(struct s_uart_pcb *uart);
static bool uart_get_dma_ht_flag(struct s_uart_pcb *uart);
static bool uart_get_dma_tc_flag(struct s_uart_pcb *uart);
static void uart_clear_dma_te_flag(struct s_uart_pcb *uart);
static void uart_clear_dma_ht_flag(struct s_uart_pcb *uart);
static void uart_clear_dma_tc_flag(struct s_uart_pcb *uart);
static void uart_start_dma_rx(struct s_uart_pcb *uart);
static void uart_stop_dma_rx(struct s_uart_pcb *uart);
static bool uart_is_dma_rx_running(struct s_uart_pcb *uart);
static size_t uart_update_rx_buffer_from_isr(struct s_uart_pcb *uart, bool dma_tc, uint16_t dma_ndt);
static void uart_suspend_rx_from_isr(struct s_uart_pcb *uart, signed portBASE_TYPE *pxHigherPriorityTaskWoken);
static bool uart_update_rx_data_indication_from_isr(struct s_uart_pcb *uart, size_t bytes_transfered, bool rx_active, signed portBASE_TYPE *pxHigherPriorityTaskWoken);
static void uart_timer_rx_data_callback(TimerHandle_t xTimer);
static void uart_usart_irq_handler(struct s_uart_pcb *uart);
static void uart_usart_irq_handler_rx(struct s_uart_pcb *uart, uint16_t usart_SR, signed portBASE_TYPE *pxHigherPriorityTaskWoken);
static void uart_usart_irq_handler_tx(struct s_uart_pcb *uart, uint16_t usart_SR, signed portBASE_TYPE *pxHigherPriorityTaskWoken);
static void uart_dma_rx_irq_handler(struct s_uart_pcb *uart);

void halinternal_uart_init(void) {
	for (int i = 0; i < sizeof(uart_pcbs)/sizeof(uart_pcbs[0]); i++) {
		struct s_uart_pcb *uart = &(uart_pcbs[i]);
		/* Init freertos timer for defered rx data indication */
		uart->rx_data_timer = xTimerCreate("HAL_UART_rx_data_X", 1/*doesn't matter*/, pdFALSE, (void *)uart, uart_timer_rx_data_callback);
		halinternal_freertos_timer_queue_length += 3; // must match usage scenario (xTimerXXX calls, calls contexts, worst case of queuing)
		/* Init semaphore used for tx transfer completion synchronization */
		uart->smphr_tx_complete = xSemaphoreCreateCounting(1, 0);
		/* Init DMA stream used for rx */
		RCC->AHB1ENR |= (uart->dma_rx_rcc_ahb1enr);
		uart->dma_rx_stream->CR = 0;
		uart->dma_rx_stream->CR |= uart->dma_rx_channel << POSITION_VAL(DMA_SxCR_CHSEL);
		uart->dma_rx_stream->CR |= DMA_SxCR_MINC;
		uart->dma_rx_stream->CR |= DMA_SxCR_CIRC;
		uart->dma_rx_stream->FCR = 0;
		uart->dma_rx_stream->PAR = (uint32_t)&(uart->usart->DR);
		/* Init NVIC interrupts of USART and rx DMA stream */
		halinternal_set_nvic_priority(uart->usart_irq_n);
		halinternal_set_nvic_priority(uart->dma_rx_stream_irq_n);
	}
}

void hal_uart_set_default_params(hal_uart_params_t *params) {
	SYS_ASSERT(params);
	params->baud_rate = 115200;
	params->stop_bits = huartStopBits_1;
	params->parity = huartParity_None;
	params->hw_flow_control = huartHwFlowControl_None;
	params->rx_buffer_size = 0;
	params->tx_buffer_size = 0;
	params->rx_data_pending_interval = 0;
	params->userid = 0;
	params->isrcallbackRxDataPending = NULL;
	params->isrcallbackRxDataErrors = NULL;
	params->isrcallbackRxOverflowSuspended = NULL;
	params->isrcallbackTxSpacePending = NULL;
	params->isrcallbackTxCompleted = NULL;
}

hal_uart_handle_t hal_uart_open(int instance, hal_uart_params_t *params, hal_ringbuffer_t **rx_buffer, hal_ringbuffer_t **tx_buffer) {
	struct s_uart_pcb *uart = &(uart_pcbs[instance-1]);
	size_t total_rx_buffer_size;
	hal_ringbuffer_t *new_rx_buffer = 0;
	hal_ringbuffer_t *new_tx_buffer = 0;

	SYS_ASSERT((1 <= instance) && (instance <= UART_INSTANCES_COUNT));
	SYS_ASSERT(params);
	SYS_ASSERT(params->isrcallbackRxOverflowSuspended); // required in order to support hal_uart_start_rx()
	SYS_ASSERT(params->rx_buffer_size > 0); // rx buffer required because reception is always enabled
	SYS_ASSERT(xTaskGetSchedulerState() == taskSCHEDULER_RUNNING); // due to freertos semaphores and timers usage

	int max_irq_service_delay = 0;
	if (!((params->hw_flow_control == huartHwFlowControl_Rx) || (params->hw_flow_control == huartHwFlowControl_Rx_Tx)))
		max_irq_service_delay = SYS_MAX_IRQ_LATENCY_MS;
	double character_rate = uart_character_rate_from_baud_rate(params->baud_rate, params->stop_bits, params->parity);
	size_t extra_rx_buffer_space = ceil(character_rate*((double)(max(max_irq_service_delay, (params->rx_data_pending_interval + 1)))/1000));
	total_rx_buffer_size = params->rx_buffer_size + extra_rx_buffer_space; // extra space required to mitigate system-level processing delays
	total_rx_buffer_size += (total_rx_buffer_size % 2); // round up to nearest even number (required to determine DMA half-transfer condition properly)
	SYS_ASSERT(total_rx_buffer_size <= MAX_DMA_TRANSFER_SIZE); // incompatible uart baudrate and (system characteristics and/or uart parameters)

