EgorNezox/Lol/system/platform/stm32f2-common/system_hardware/uart.c
	struct {
		uint16_t BRR;
		uint16_t CR1;
		uint16_t CR2;
		uint16_t CR3;
		uint32_t tmpreg;
		uint32_t apbclock;
		uint32_t integerdivider;
		uint32_t fractionaldivider;
	} usart_init_struct = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
	halinternal_rcc_clocks_t rcc_clocks;
	SYS_ASSERT((params->baud_rate > 0) && (params->baud_rate < 7500001));
	if (params->hw_flow_control != huartHwFlowControl_None)
		SYS_ASSERT(IS_UART_HWFLOW_INSTANCE(uart->usart));
	switch (params->stop_bits) {
	case huartStopBits_0_5: usart_init_struct.CR2 |= USART_CR2_STOP_0; break;
	case huartStopBits_1: usart_init_struct.CR2 |= 0; break;
	case huartStopBits_1_5: usart_init_struct.CR2 |= USART_CR2_STOP_0 | USART_CR2_STOP_1; break;
	case huartStopBits_2: usart_init_struct.CR2 |= USART_CR2_STOP_1; break;
	default: SYS_ASSERT(0); break;
	}
	if (params->parity != huartParity_None)
		usart_init_struct.CR1 |= USART_CR1_M;
	switch (params->parity) {
	case huartParity_None: usart_init_struct.CR1 |= 0; break;
	case huartParity_Even: usart_init_struct.CR1 |= USART_CR1_PCE; break;
	case huartParity_Odd: usart_init_struct.CR1 |= USART_CR1_PCE | USART_CR1_PS; break;
	default: SYS_ASSERT(0); break;
	}
	usart_init_struct.CR1 |= USART_CR1_RE | USART_CR1_TE;
	switch (params->hw_flow_control) {
	case huartHwFlowControl_None: usart_init_struct.CR3 |= 0; break;
	case huartHwFlowControl_Rx: usart_init_struct.CR3 |= USART_CR3_RTSE; break;
	case huartHwFlowControl_Tx: usart_init_struct.CR3 |= USART_CR3_CTSE; break;
	case huartHwFlowControl_Rx_Tx: usart_init_struct.CR3 |= USART_CR3_RTSE | USART_CR3_CTSE; break;
	default: SYS_ASSERT(0); break;
	}
	halinternal_get_rcc_clocks(&rcc_clocks);
	if ((instance == 1) || (instance == 6))
		usart_init_struct.apbclock = rcc_clocks.pclk2_frequency;
	else
		usart_init_struct.apbclock = rcc_clocks.pclk1_frequency;
	if ((usart_init_struct.CR1 & USART_CR1_OVER8) != 0)
		usart_init_struct.integerdivider = ((25 * usart_init_struct.apbclock) / (2 * (params->baud_rate)));
	else
		usart_init_struct.integerdivider = ((25 * usart_init_struct.apbclock) / (4 * (params->baud_rate)));
	usart_init_struct.tmpreg = (usart_init_struct.integerdivider / 100) << 4;
	usart_init_struct.fractionaldivider = usart_init_struct.integerdivider - (100 * (usart_init_struct.tmpreg >> 4));
	if ((usart_init_struct.CR1 & USART_CR1_OVER8) != 0)
		usart_init_struct.tmpreg |= ((((usart_init_struct.fractionaldivider * 8) + 50) / 100)) & ((uint8_t)0x07);
	else
		usart_init_struct.tmpreg |= ((((usart_init_struct.fractionaldivider * 16) + 50) / 100)) & ((uint8_t)0x0F);
	usart_init_struct.BRR = (uint16_t)usart_init_struct.tmpreg;

	new_rx_buffer = hal_ringbuffer_create(total_rx_buffer_size, 0);
	if (rx_buffer)
		*rx_buffer = new_rx_buffer;
	if (params->tx_buffer_size > 0)
		new_tx_buffer = hal_ringbuffer_create(params->tx_buffer_size, 0);
	if (tx_buffer)
		*tx_buffer = new_tx_buffer;

	portDISABLE_INTERRUPTS();
	/* Mark peripheral instance as busy */
	SYS_ASSERT(uart->is_open == false);
	uart->is_open = true;
	/* Enable USART peripheral clock */
	if (uart->usart_apb == 1)
		RCC->APB1ENR |= (uart->usart_rcc_apb_mask);
	else if (uart->usart_apb == 2)
		RCC->APB2ENR |= (uart->usart_rcc_apb_mask);
	/* Init USART peripheral */
	uart->usart->CR2 = usart_init_struct.CR2;
	uart->usart->CR1 = usart_init_struct.CR1;
	uart->usart->CR3 = usart_init_struct.CR3;
	uart->usart->BRR = usart_init_struct.BRR;
	/* Init USART and DMA interrupts */
	NVIC_EnableIRQ(uart->usart_irq_n);
	NVIC_EnableIRQ(uart->dma_rx_stream_irq_n);
	uart->dma_rx_stream->CR |= DMA_SxCR_TEIE;
	portENABLE_INTERRUPTS();

	uart->userid = params->userid;
	uart->rx_buffer = new_rx_buffer;
	uart->tx_buffer = new_tx_buffer;
	uart->rx_buffer_extra_space = extra_rx_buffer_space;
	if (params->rx_data_pending_interval > 0) {
		uart->rx_data_defer_indication = true;
		xTimerChangePeriod(uart->rx_data_timer, (params->rx_data_pending_interval/portTICK_PERIOD_MS), portMAX_DELAY);
		xTimerStop(uart->rx_data_timer, portMAX_DELAY); // because previous xTimerChangePeriod() stupidly starts timer
	}
	uart->isrcallbackRxDataPending = params->isrcallbackRxDataPending;
	uart->isrcallbackRxDataErrors = params->isrcallbackRxDataErrors;
	uart->isrcallbackRxOverflowSuspended = params->isrcallbackRxOverflowSuspended;
	uart->isrcallbackTxSpacePending = params->isrcallbackTxSpacePending;
	uart->isrcallbackTxCompleted = params->isrcallbackTxCompleted;
	hal_uart_start_rx((hal_uart_handle_t)uart);
	xSemaphoreTake(uart->smphr_tx_complete, 0);
	uart->usart->CR1 |= USART_CR1_UE; // enable USART peripheral

	return (hal_uart_handle_t)uart;
}

void hal_uart_close(hal_uart_handle_t handle) {
	DEFINE_PCB_FROM_HANDLE(uart, handle)
	SYS_ASSERT(xTaskGetSchedulerState() == taskSCHEDULER_RUNNING); // due to freertos semaphores and timers usage

	uart->rx_data_timer_state = rxdatatimerIdle;
	if (uart->rx_data_defer_indication)
		xTimerStop(uart->rx_data_timer, portMAX_DELAY);
	portDISABLE_INTERRUPTS();
	uart->usart->CR1 &= ~USART_CR1_UE; // disable USART peripheral
	uart_stop_dma_rx(uart);
	uart_set_rx_interrupts(uart, DISABLE);
	if (uart->tx_transfer != txtransferNone)
		NVIC_SetPendingIRQ(uart->usart_irq_n); // force processing of transmission completion (interruption)
	uart->tx_transfer_data_ptr = 0;
	uart->tx_transfer_pending_size = 0;
	if (uart->tx_buffer)
		hal_ringbuffer_flush_read(uart->tx_buffer);
	uart_set_tx_interrupts(uart, DISABLE);
	portENABLE_INTERRUPTS();
	// usart tx interrupt (requested transmission interruption) activates right here (just after exit from critical section)

	if (uart->tx_buffer)
		hal_ringbuffer_delete(uart->tx_buffer);
	hal_ringbuffer_delete(uart->rx_buffer);
	uart->userid = 0;
	uart->rx_buffer = 0;
	uart->tx_buffer = 0;
	uart->rx_buffer_extra_space = 0;
	uart->rx_data_defer_indication = false;
	uart->isrcallbackRxDataPending = NULL;
	uart->isrcallbackRxDataErrors = NULL;
	uart->isrcallbackRxOverflowSuspended = NULL;
	uart->isrcallbackTxSpacePending = NULL;
	uart->isrcallbackTxCompleted = NULL;

	portDISABLE_INTERRUPTS();
	/* Mark peripheral instance as not busy */
	SYS_ASSERT(uart->is_open == true);
	uart->is_open = false;
	/* Deinit DMA and USART interrupts */
	uart->dma_rx_stream->CR &= ~DMA_SxCR_TEIE;
	NVIC_DisableIRQ(uart->dma_rx_stream_irq_n);
	NVIC_DisableIRQ(uart->usart_irq_n);
	/* Reset USART peripheral */
	if (uart->usart_apb == 1) {
		RCC->APB1RSTR |= (uart->usart_rcc_apb_mask);
		RCC->APB1RSTR &= ~(uart->usart_rcc_apb_mask);
	} else if (uart->usart_apb == 2) {
		RCC->APB2RSTR |= (uart->usart_rcc_apb_mask);
		RCC->APB2RSTR &= ~(uart->usart_rcc_apb_mask);
	}
	/* Disable USART peripheral clock */
	if (uart->usart_apb == 1)
		RCC->APB1ENR &= ~(uart->usart_rcc_apb_mask);
	else if (uart->usart_apb == 2)
		RCC->APB2ENR &= ~(uart->usart_rcc_apb_mask);
	portENABLE_INTERRUPTS();
}

void* hal_uart_get_userid(hal_uart_handle_t handle) {
	DEFINE_PCB_FROM_HANDLE(uart, handle)
	return uart->userid;
}

static double uart_character_rate_from_baud_rate(uint32_t rate, hal_uart_stop_bits_t stop_bits, hal_uart_parity_t parity) {
	double character_bits = 1.0 + 8.0; /*start bit + data word bits*/
	if (parity != huartParity_None)
		character_bits += 1.0; /* + optional parity bit*/
	switch (stop_bits) {
	case huartStopBits_0_5: character_bits += 0.5; break;
	case huartStopBits_1: character_bits += 1.0; break;
	case huartStopBits_1_5: character_bits += 1.5; break;
	case huartStopBits_2: character_bits += 2.0; break;
	default: SYS_ASSERT(0); break;
	}
	return (double)(rate)/character_bits;
}

static void uart_set_rx_interrupts(struct s_uart_pcb *uart, FunctionalState state) {
	if (state == ENABLE) {
		uart->usart->CR1 |= USART_CR1_RXNEIE;
		uart->usart->CR1 |= USART_CR1_PEIE;
		uart->usart->CR3 |= USART_CR3_EIE;
	} else {
		uart->usart->CR1 &= ~USART_CR1_RXNEIE;
		uart->usart->CR1 &= ~USART_CR1_PEIE;
		uart->usart->CR3 &= ~USART_CR3_EIE;
	}
}

