EgorNezox/Lol/system/platform/stm32f2-common/system_hardware/uart.c
static void uart_set_tx_interrupts(struct s_uart_pcb *uart, FunctionalState state) {
	if (state == ENABLE) {
		uart->usart->CR1 |= USART_CR1_TXEIE;
		uart->usart->CR1 |= USART_CR1_TCIE;
	} else {
		uart->usart->CR1 &= ~USART_CR1_TXEIE;
		uart->usart->CR1 &= ~USART_CR1_TCIE;
	}
}

static bool uart_get_dma_te_flag(struct s_uart_pcb *uart) {
	bool status;
	if (uart->dma_rx_stream_number > 3)
		status = (uart->dma_rx->HISR & uart->dma_rx_teif_mask);
	else
		status = (uart->dma_rx->LISR & uart->dma_rx_teif_mask);
	return status;
}

static bool uart_get_dma_ht_flag(struct s_uart_pcb *uart) {
	bool status;
	if (uart->dma_rx_stream_number > 3)
		status = (uart->dma_rx->HISR & uart->dma_rx_htif_mask);
	else
		status = (uart->dma_rx->LISR & uart->dma_rx_htif_mask);
	return status;
}

static bool uart_get_dma_tc_flag(struct s_uart_pcb *uart) {
	bool status;
	if (uart->dma_rx_stream_number > 3)
		status = (uart->dma_rx->HISR & uart->dma_rx_tcif_mask);
	else
		status = (uart->dma_rx->LISR & uart->dma_rx_tcif_mask);
	return status;
}

static void uart_clear_dma_te_flag(struct s_uart_pcb *uart) {
	if (uart->dma_rx_stream_number > 3)
		uart->dma_rx->HIFCR = uart->dma_rx_teif_mask;
	else
		uart->dma_rx->LIFCR = uart->dma_rx_teif_mask;
}

static void uart_clear_dma_ht_flag(struct s_uart_pcb *uart) {
	if (uart->dma_rx_stream_number > 3)
		uart->dma_rx->HIFCR = uart->dma_rx_htif_mask;
	else
		uart->dma_rx->LIFCR = uart->dma_rx_htif_mask;
}

static void uart_clear_dma_tc_flag(struct s_uart_pcb *uart) {
	if (uart->dma_rx_stream_number > 3)
		uart->dma_rx->HIFCR = uart->dma_rx_tcif_mask;
	else
		uart->dma_rx->LIFCR = uart->dma_rx_tcif_mask;
}

static void uart_start_dma_rx(struct s_uart_pcb *uart) {
	uart_clear_dma_ht_flag(uart);
	uart_clear_dma_tc_flag(uart);
	uart->dma_rx_stream->CR |= DMA_SxCR_EN;
	uart->usart->CR3 |= USART_CR3_DMAR;
}

static void uart_stop_dma_rx(struct s_uart_pcb *uart) {
	uart->usart->CR3 &= ~USART_CR3_DMAR;
	uart->dma_rx_stream->CR &= ~DMA_SxCR_EN;
	while ((uart->dma_rx_stream->CR & DMA_SxCR_EN) != 0);
}

static bool uart_is_dma_rx_running(struct s_uart_pcb *uart) {
	return ((uart->dma_rx_stream->CR & DMA_SxCR_EN) != 0);
}

bool hal_uart_start_rx(hal_uart_handle_t handle) {
	DEFINE_PCB_FROM_HANDLE(uart, handle)
	bool success = false;
	portDISABLE_INTERRUPTS();
	if (!uart_is_dma_rx_running(uart)) {
		hal_ringbuffer_reset(uart->rx_buffer);
		/* Prepare memory address and size for DMA transfer */
		uint8_t *buffer_ptr;
		size_t buffer_size;
		hal_ringbuffer_get_write_ptr(uart->rx_buffer, &buffer_ptr, &buffer_size); // expected to be whole ringbuffer
		hal_ringbuffer_write_next(uart->rx_buffer, 0);
		uart->dma_rx_stream->M0AR = (uint32_t)buffer_ptr;
		uart->dma_rx_stream->NDTR = (uint16_t)buffer_size;
		/* Reset USART rx state */
		(void)uart->usart->SR;
		(void)uart->usart->DR;
		uart->rx_data_timer_state = rxdatatimerIdle;
		/* Start DMA rx transfer and be ready to accept stream */
		uart_start_dma_rx(uart);
		uart_set_rx_interrupts(uart, ENABLE);
		/* Mark success */
		success = true;
	}
	portENABLE_INTERRUPTS();
	return success;
}

bool hal_uart_start_tx(hal_uart_handle_t handle) {
	DEFINE_PCB_FROM_HANDLE(uart, handle)
	if (!((uart->tx_buffer) && (uart->tx_transfer == txtransferNone)))
		return false;
	bool success = false;
	portDISABLE_INTERRUPTS();
	if (!hal_ringbuffer_is_empty(uart->tx_buffer)) {
		uart->tx_transfer = txtransferActiveInternal;
		uart_set_tx_interrupts(uart, ENABLE);
		success = true;
	}
	portENABLE_INTERRUPTS();
	return success;
}

int hal_uart_receive(hal_uart_handle_t handle, uint8_t *buffer, int max_size) {
	DEFINE_PCB_FROM_HANDLE(uart, handle)
	SYS_ASSERT(buffer);
	SYS_ASSERT(max_size > 0);
	int result = 0;
	hal_ringbuffer_ctrl_t buffer_ctrl;
	uint8_t *chunk_ptr;
	size_t chunk_size;
	portDISABLE_INTERRUPTS();
	buffer_ctrl = hal_ringbuffer_get_ctrl(uart->rx_buffer);
	portENABLE_INTERRUPTS();
	while (max_size > 0) {
		hal_ringbuffer_extctrl_get_read_ptr(&buffer_ctrl, &chunk_ptr, &chunk_size);
		if (chunk_size == 0)
			break;
		chunk_size = min(max_size, chunk_size);
		memcpy(buffer, chunk_ptr, chunk_size);
		buffer += chunk_size;
		max_size -= chunk_size;
		hal_ringbuffer_extctrl_read_next(&buffer_ctrl, chunk_size);
		result += chunk_size;
	}
	portDISABLE_INTERRUPTS();
	hal_ringbuffer_update_read_ctrl(uart->rx_buffer, &buffer_ctrl);
	portENABLE_INTERRUPTS();
	return result;
}

bool hal_uart_transmit_blocked(hal_uart_handle_t handle, uint8_t *data, int size, TickType_t block_time) {
	DEFINE_PCB_FROM_HANDLE(uart, handle)
	SYS_ASSERT(data);
	SYS_ASSERT(size > 0);
	if (!(uart->tx_transfer == txtransferNone))
		return false;
	portDISABLE_INTERRUPTS();
	uart->tx_transfer = txtransferActiveExternalSync;
	uart->tx_transfer_data_ptr = data;
	uart->tx_transfer_pending_size = size;
	uart_set_tx_interrupts(uart, ENABLE);
	portENABLE_INTERRUPTS();
	xSemaphoreTake(uart->smphr_tx_complete, block_time);
	return (uart->tx_transfer == txtransferNone);
}

bool hal_uart_start_transmit(hal_uart_handle_t handle, uint8_t *data, int size) {
	DEFINE_PCB_FROM_HANDLE(uart, handle)
	SYS_ASSERT(data);
	SYS_ASSERT(size > 0);
	if (!(uart->tx_transfer == txtransferNone))
		return false;
	portDISABLE_INTERRUPTS();
	uart->tx_transfer = txtransferActiveExternalAsync;
	uart->tx_transfer_data_ptr = data;
	uart->tx_transfer_pending_size = size;
	uart_set_tx_interrupts(uart, ENABLE);
	portENABLE_INTERRUPTS();
	return true;
}

static size_t uart_update_rx_buffer_from_isr(struct s_uart_pcb *uart, bool dma_tc, uint16_t dma_ndt) {
	size_t bytes_transfered;
	uint8_t *buffer_write_ptr;
	size_t dummy;
	int buffer_size = hal_ringbuffer_get_size(uart->rx_buffer);
	uint8_t *buffer_start_addr = (uint8_t *)uart->dma_rx_stream->M0AR;
	hal_ringbuffer_get_write_ptr(uart->rx_buffer, &buffer_write_ptr, &dummy);
	bytes_transfered = (int)((buffer_size - dma_ndt) - (buffer_write_ptr - buffer_start_addr) + dma_tc*buffer_size);
	hal_ringbuffer_write_next(uart->rx_buffer, bytes_transfered);
	return bytes_transfered;
}

static void uart_suspend_rx_from_isr(struct s_uart_pcb *uart, signed portBASE_TYPE *pxHigherPriorityTaskWoken) {
	uart_set_rx_interrupts(uart, DISABLE);
	uart->rx_data_timer_state = rxdatatimerIdle;
	if (uart->rx_data_defer_indication)
		xTimerStopFromISR(uart->rx_data_timer, pxHigherPriorityTaskWoken);
	if (uart_is_dma_rx_running(uart))
		uart_stop_dma_rx(uart);
}

