EgorNezox/Lol/system/platform/stm32f2-common/system_hardware/uart.c
/* For non-zero interval it controls timer scheduling, timeout processing and managing USART RXNE interrupt */
static bool uart_update_rx_data_indication_from_isr(struct s_uart_pcb *uart, size_t bytes_transfered, bool rx_active, signed portBASE_TYPE *pxHigherPriorityTaskWoken) {
	bool result = false;
	if ((uart->rx_data_defer_indication) && rx_active) {
		if (uart->rx_data_timer_state == rxdatatimerExpired) {
			uart->rx_data_timer_state = rxdatatimerIdle;
			result = !hal_ringbuffer_is_empty(uart->rx_buffer);
		}
		if ((bytes_transfered > 0) && (uart->rx_data_timer_state != rxdatatimerActive)) {
			uart->usart->CR1 &= ~USART_CR1_RXNEIE; // disable rx interrupt at least for timer period and don't process active streaming
			uart->rx_data_timer_state = rxdatatimerActive;
			xTimerStartFromISR(uart->rx_data_timer, pxHigherPriorityTaskWoken); // when timer expires it will trigger this processing again
		}
	} else {
		result = (bytes_transfered > 0);
	}
	return result;
}

static void uart_timer_rx_data_callback(TimerHandle_t xTimer) {
	DEFINE_PCB_FROM_HANDLE(uart, pvTimerGetTimerID(xTimer))
	portDISABLE_INTERRUPTS();
	if ((uart->rx_data_timer_state == rxdatatimerActive) && (uart->usart->CR1 & USART_CR1_UE)) {
		uart->usart->CR1 |= USART_CR1_RXNEIE; // enable uart rx interrupt back again
		uart->rx_data_timer_state = rxdatatimerExpired;
		/* invoke rx handler to process rx data indication (with updated flag)
		 * this solution isn't perfect, but unified with timer-less method of indication
		 */
		NVIC_SetPendingIRQ(uart->usart_irq_n);
	}
	portENABLE_INTERRUPTS();
}

/* Note, that this handler may be triggered not only by USART hardware interrupt request, but also in software.
 * In particularly, it DOES NOT mean there are any hardware flag pending.
 */
static void uart_usart_irq_handler(struct s_uart_pcb *uart) {
	portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
	/* USART status register must be read once in order to:
	 * - prevent loss of pending flags (such as known issue with PE);
	 * - prevent loss of events occurred while irq handler is active;
	 * - provide guaranteed TC bit clearing sequence (in sync with write access to DR register).
	 */
	uint16_t usart_SR = uart->usart->SR;
	if (uart->usart->CR1 & USART_CR1_UE) // uart enabled ?
		uart_usart_irq_handler_rx(uart, usart_SR, &xHigherPriorityTaskWoken);
	uart_usart_irq_handler_tx(uart, usart_SR, &xHigherPriorityTaskWoken);
	portEND_SWITCHING_ISR(xHigherPriorityTaskWoken);
}

static void uart_usart_irq_handler_rx(struct s_uart_pcb *uart, uint16_t usart_SR, signed portBASE_TYPE *pxHigherPriorityTaskWoken) {
	bool errors_detected = false;
	bool overflow_detected = false;
	size_t bytes_transfered = 0;
	bool data_indication_required = false;
	uint16_t buffer_size = hal_ringbuffer_get_size(uart->rx_buffer);
	bool flag_dma_ht, flag_dma_tc;
	uint16_t current_dma_ndt;

	/* Capture DMA buffer state */
	flag_dma_ht = uart_get_dma_ht_flag(uart);
	flag_dma_tc = uart_get_dma_tc_flag(uart);
	current_dma_ndt = (uint16_t)uart->dma_rx_stream->NDTR; // must be captured after HT,TC flags

	/* Process streaming if it's active */
	// warning: dependency on RXNEIE requires special handling in uart_update_rx_data_indication_from_isr() and uart_timer_rx_data_callback() !
	if ((uart->usart->CR1 & USART_CR1_RXNEIE) && (uart_is_dma_rx_running(uart))) {
		if (!(flag_dma_ht && flag_dma_tc)) {
			if (flag_dma_ht && (current_dma_ndt >= (buffer_size>>1))) // did NDT crossed half-buffer mark since previous capture ?
				uart_clear_dma_ht_flag(uart); // condition above ensures that we will not lose flag which may appear at once
			if (flag_dma_tc && (current_dma_ndt < (buffer_size>>1))) // did NDT wrapped from end to start of buffer since previous capture ?
				uart_clear_dma_tc_flag(uart); // condition above ensures that we will not lose flag which may appear at once
			bytes_transfered += uart_update_rx_buffer_from_isr(uart, flag_dma_tc, current_dma_ndt);
			if (hal_ringbuffer_get_free_space_size(uart->rx_buffer) <= uart->rx_buffer_extra_space) // normal buffer overflow
				overflow_detected = true;
		} else { // critical buffer overflow
			overflow_detected = true;
			uart_stop_dma_rx(uart);
		}
	}

	/* Process possible failures in streaming if it's active */
	if (uart->usart->CR3 & USART_CR3_EIE) {
		errors_detected = usart_SR & (USART_SR_PE | USART_SR_FE | USART_SR_NE);
		overflow_detected |= (usart_SR & USART_SR_ORE) || (!uart_is_dma_rx_running(uart)); // both checks required (otherwise RXNE will cause interrupt remain pending)
		if (errors_detected)
			(void)uart->usart->DR; // dummy read required to reset flags (yes, there are races with DMA, but we are agree to loss one byte in such conditions)
		/* Process possible overflow condition in stream */
		if (overflow_detected) {
			if (uart_is_dma_rx_running(uart)) { // was it forced to stop ?
				/* write transferred chunk to buffer (if any) */
				bytes_transfered += uart_update_rx_buffer_from_isr(uart, flag_dma_tc, current_dma_ndt);
			}
			uart_suspend_rx_from_isr(uart, pxHigherPriorityTaskWoken);
		}
	}

	/* Process rx data indication conditions and state */
	data_indication_required = uart_update_rx_data_indication_from_isr(uart, bytes_transfered, (uart_is_dma_rx_running(uart)), pxHigherPriorityTaskWoken);

	/* Indicate user pending data errors in stream (must be after last transfer completed in order to account all possible error bytes) */
	if (errors_detected && uart->isrcallbackRxDataErrors)
		uart->isrcallbackRxDataErrors((hal_uart_handle_t)uart, hal_ringbuffer_get_pending_data_size(uart->rx_buffer), pxHigherPriorityTaskWoken);
	/* Indicate user transferred data (written in buffer) and possible stream suspension (overflow status) */
	if (data_indication_required && uart->isrcallbackRxDataPending)
		uart->isrcallbackRxDataPending((hal_uart_handle_t)uart, hal_ringbuffer_get_pending_data_size(uart->rx_buffer), pxHigherPriorityTaskWoken);
	if (overflow_detected && uart->isrcallbackRxOverflowSuspended)
		uart->isrcallbackRxOverflowSuspended((hal_uart_handle_t)uart, pxHigherPriorityTaskWoken);
}

static void uart_usart_irq_handler_tx(struct s_uart_pcb *uart, uint16_t usart_SR, signed portBASE_TYPE *pxHigherPriorityTaskWoken) {
	/* Process active transmission (from any buffer) and transfer completion (optimized, see warnings) */
	bool more_data_pending;
	switch (uart->tx_transfer) {
	case txtransferActiveInternal:
		more_data_pending = !hal_ringbuffer_is_empty(uart->tx_buffer);
		break;
	case txtransferActiveExternalAsync:
	case txtransferActiveExternalSync:
		more_data_pending = (uart->tx_transfer_pending_size > 0);
		break;
	default:
		more_data_pending = false;
		break;
	}
	if (more_data_pending && (usart_SR & USART_SR_TXE)) { // warning: pending data in buffer must be flushed when uart disabled
		// warning: here is the only place to write DR register (see uart_usart_irq_handler)
		bool disable_txe_interrupt; // last byte transferred ?
		switch (uart->tx_transfer) {
		case txtransferActiveInternal: {
			int pending_size;
			hal_ringbuffer_read_byte(uart->tx_buffer, (uint8_t *)&(uart->usart->DR));
			pending_size = hal_ringbuffer_get_pending_data_size(uart->tx_buffer);
			if (uart->isrcallbackTxSpacePending)
				uart->isrcallbackTxSpacePending((hal_uart_handle_t)uart, hal_ringbuffer_get_free_space_size(uart->tx_buffer), pxHigherPriorityTaskWoken);
			disable_txe_interrupt = (pending_size == 0);
			break;
		}
		case txtransferActiveExternalAsync:
		case txtransferActiveExternalSync: {
			uart->usart->DR = *((uart->tx_transfer_data_ptr)++);
			uart->tx_transfer_pending_size--;
			disable_txe_interrupt = (uart->tx_transfer_pending_size == 0);
			break;
		}
		default:
			disable_txe_interrupt = true;
			break;
		}
		if (disable_txe_interrupt)
			uart->usart->CR1 &= ~USART_CR1_TXEIE; // disable TXE interrupt (since it cannot be cleared and will remain pending)
	} else if ((uart->tx_transfer != txtransferNone) && ((usart_SR & USART_SR_TC) || !(uart->usart->CR1 & USART_CR1_UE))) {
		// warning:	such conditions and checks above are sensible to TC bit clearing sequence and transmission interruption
		// 			(see uart_usart_irq_handler and hal_uart_close)
		uart->usart->CR1 &= ~(USART_CR1_TCIE | USART_CR1_TXEIE);
		switch (uart->tx_transfer) {
		case txtransferActiveInternal:
		case txtransferActiveExternalAsync:
			if (uart->isrcallbackTxCompleted)
				uart->isrcallbackTxCompleted((hal_uart_handle_t)uart, pxHigherPriorityTaskWoken);
			break;
		case txtransferActiveExternalSync:
			xSemaphoreGiveFromISR(uart->smphr_tx_complete, pxHigherPriorityTaskWoken);
			break;
		default: break;
		}
		uart->tx_transfer = txtransferNone;
	}
}

static void uart_dma_rx_irq_handler(struct s_uart_pcb *uart) {
	portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
	/* DMA transfer error (bus error ?) */
	if (uart_get_dma_te_flag(uart)) {
		uart_suspend_rx_from_isr(uart, &xHigherPriorityTaskWoken);
		uart_clear_dma_te_flag(uart);
		halinternal_system_fault_handler();
	}
	portEND_SWITCHING_ISR(xHigherPriorityTaskWoken);
}

void USART1_IRQHandler(void) {
	uart_usart_irq_handler(&uart_pcbs[0]);
}
void USART2_IRQHandler(void) {
	uart_usart_irq_handler(&uart_pcbs[1]);
}
void USART3_IRQHandler(void) {
	uart_usart_irq_handler(&uart_pcbs[2]);
}
void UART4_IRQHandler(void) {
	uart_usart_irq_handler(&uart_pcbs[3]);
}
void UART5_IRQHandler(void) {
	uart_usart_irq_handler(&uart_pcbs[4]);
}
void USART6_IRQHandler(void) {
	uart_usart_irq_handler(&uart_pcbs[5]);
}
void DMA2_Stream2_IRQHandler(void) {
	uart_dma_rx_irq_handler(&uart_pcbs[0]);
}
void DMA1_Stream5_IRQHandler(void) {
	uart_dma_rx_irq_handler(&uart_pcbs[1]);
}
void DMA1_Stream1_IRQHandler(void) {
	uart_dma_rx_irq_handler(&uart_pcbs[2]);
}
void DMA1_Stream2_IRQHandler(void) {
	uart_dma_rx_irq_handler(&uart_pcbs[3]);
}
void DMA1_Stream0_IRQHandler(void) {
	uart_dma_rx_irq_handler(&uart_pcbs[4]);
}
void DMA2_Stream1_IRQHandler(void) {
	uart_dma_rx_irq_handler(&uart_pcbs[5]);
}
